import './Register.scss'

const Register = () => {
  // هنا لو عاوزه تكتبي اي دالة او كود

  return (
    <>
      <div className="register">
        {/* هنا اكتبي كود ال HTML عادي جدا. */}
        {/* وملف الSass / CSS مربوط وامورك تمام  وموجود في نفس المجلد*/}
        {/* في بعض الحاجات متغير اسمها عشان هيا محجوزه لل Javascript زي مثلاً */}
        {/* class ---> className */}
        {/* for ---> htmlFor */}
        {/* onsubmit ---> onSubmit */}
        {/* عشان تكتبي كود JS بداخل ال JSX هتفتح قوسين كدا. زي مثلاً */}
        {alert('هنا يبدأ شغل ندى👍')}
      </div>
    </>
  )
}

export default Register
